College Notes/exports/23MAT204.tex
\section{Newton's Method}
\label{sec:org47f5d12}
Newton's Method is a numerical method to find a minimum of a function.

Iterative formula:

\[
x_{n+1} = x_n - \frac{f'(x_n)}{f''(x_n)}
\]

Find the minimum of \(f(x) = x^2 + \frac{54}{x}\) using Newton's method.

Newton's method can be practically done for all functions by evaluating the first and second derivatives numerically and then apply the formula

$$x_{n+1} = x_n - \frac{f(x_n)}{f'(x_n)} \text{to find root of $f(x)$ = 0}$$
$$x_{n+1} = x_n - \frac{f(x_n)}{f'(x_n)} \text{to find minimum of $f(x)$(root of $f'(x) = 0)}$$

Evaluation of first and second derivatives numerically:

$$f'(a) = \frac{f(a+\Delta a)-f(a-\Delta a)}{2 \Delta a}$$
$$f''(a) = \frac{f(a+\Delta a)- 2f(a) + f(a-\Delta a)}{(\Delta a)^2}$$
\section{How solution to a linear system can be found as a solution of an optimization problem.}
\label{sec:org5bbc232}
Find an objective function whose solution is specified as \(\vec{x} : A\vec{x} = b\)

Take for example, \(\frac{1}{2}x^T A x - b^T x + c\), \(x \in R^n, A = A^T\)
\section{Numerical Algorithm Of Gauss-Jacobi Method}
\label{sec:org350c17a}

Input A = [a\textsubscript{ij}], X0 = x\textsuperscript{(0)}, tolerance TOL, maximum number of iterations,

\(Ax = b\)

We separate A,
A = D - L - U

$$(D-L-U)x = b$$
$$(Dx= b + (L+U)x$$
$$(x= D^{-1}b + D^{-1}(L+U)x$$

$$x^{(k)} = Tx^{x^{(k-1)}} + c$$


The code to implement the method:
\begin{verbatim}
A = [5,-2,3;-3,9,1;2,-1,-7];
b = [-1;2;3];

n = 100; % No. of iterations
D = diag(diag(A));
L = -tril(A,-1);
U = -triu(A,1);

X = zeros(size(A)(1),n);
T = inv(D)*(L+U);
c = inv(D)*b;

for i = 2:n
  X(:,i) = T*X(:,i-1) + c;
  if(X(:,i) == X(:,i-1))
    i-1
    break;
  end
end
\end{verbatim}
\section{Gauss-Siedel Iteration Method}
\label{sec:org5c55673}
The iterative method is somewhat similar to <Gauss-Jacobi method>.

The only difference is that the new values are computed by already existing new values.

\begin{verbatim}
A = [5,-2,3;-3,9,1;2,-1,-7];
b = [-1;2;3];

n = 100; % No. of iterations
D = diag(diag(A));
L = -tril(A,-1);
U = -triu(A,1);

X = zeros(size(A)(1),n);
T = inv(D-L)*U;
c = inv(D-L)*b;

for i = 2:n
  X(:,i) = T*X(:,i-1) + c;
  if(X(:,i) == X(:,i-1))
    display("The iteration converges at:")
    i-1
    break;
  end
end
\end{verbatim}

$$(D-L)x^{k} = Ux^{k-1} + b$$
$$x^{k} = (D-L)^{-1} \vec{b} + (D-L)^{-1}(U \vec{x})$$

If the matrix is 'diagonally dominant', where the magnitude of the diagonal elements should be greater than the sum of the magnitude of the other elements(absolute value) in the same row.
\section{Unidirectional/Line search}
\label{sec:org52dc622}
For a given function,

Find the minima of \(f(x) = (x-1)^2 + (y-2)^2\) starting from \((0,0)\) along the direction of x-axis.

How to perform uni-directional search:
\begin{itemize}
\item Write the parametric representation of the line search, $$\vec{s}(t) = \vec{a} + t\vec{b}$$
\item Write the function in terms of \(t\), \(f(\vec{s}(t))\). this is a single variable function.
\item Find the minimum of \(f(\vec{s}(t))\), \(t^*\)
\item Obtain the solution for unidirectional search by substituting \(t^*\) in \(\vec{s}(t)\)

Find the minimum of the function \(f(x) = (x-2)^2 - y\), starting from the point \((-1,0)\) along \((1,1)^T\)
\end{itemize}
\section{Directions Of Change}
\label{sec:org35a9726}
A direction given by the vector \$x\textsuperscript{(k)}\} is a descent direction only if the function value decreases along that direction from the point, \(x^{(k)}\), when
$$\nabla f(x^{(k)}\cdot d < 0$$

A direction given by the vector \$x\textsuperscript{(k)}\} is an ascent direction only if the function value increases along that direction from the point, \(x^{(k)}\), when
$$\nabla f(x^{(k)}\cdot d > 0$$

Question: Check whether the given function have a descent direction \(x = (2,-1)\) along the given directions \(d_1\) and \(d_2\)
$$f = 2x_1^{2} + x_2^2-2x_1x_2 + 2x_1^3 + x_2^4$$
\section{Directions Of Descent/Ascent In Numerical Algorithms.}
\label{sec:orgf29dd6e}
In any numerical algorithm to find the optimum of an unconstrained problem, the iterative formula used is:
$$x^{k+1} = x^k + \alpha^kd^k$$
Where \(\alpha^k\) is the step length in step k and \(d^k\) is the direction of descent in step k, if it's a minimization problem or a direction of ascent if it's a maximization problem.

Newton's Method: \(x_{k+1} = x_k -(H(x_k)^{-1}\nabla f(x_k))\)
Gradient DEscent - \(x_{k+1} = x_k + \alpha_kd_k\) where \(d_k = - \nabla f(x_k)\) and \(\alpha =\) using line search

A direction along which the function increases rapidly from a point is given by the gradient of the function at that point
\section{Steepest Descent}
\label{sec:org8a5ca72}

A direction along which the function increases rapidly from a point is given by the gradient of the function at that point

A direction along which the function decreases rapidly from a point is given by the negative of the gradient of the function at that point

The iterative formula of method of steepest descent is:

$$x^{k+1} = x^k + \alpha^k d^k$$

The descent direction \(d^k\) is along the steepest descent direction, \(d^k = - \nabla f(x^k\). The step length \(\alpha^k\) is obtained by performing a unidirectional search from \(x^k\) along the direction \(d^k\), by minimizing,

This method produces successive directions that are perpendicular to each other.

Near the minima, during line search the convergence is very slow.
\section{Numerical Method}
\label{sec:orga887722}
To implement this programmatically, we can write\ldots{}
For \(Ax=b\), we can convert this to an equivalent optimization problem.
$$f(x) = \frac{1}{2}x^TAx + - b^Tx + c$$

We have a linear system of equations, which we can be solved by \(Ax=b\)

We can write \(g_0 = Ax_{0} - b\)
\section{Conjugate Gradient Descent}
\label{sec:orga7d9878}
The problem with normal gradient descent is that there is no way to predict when the function converges. There's a method that can reliably find the convergence in a predictable fashion. That's the conjugate gradient method.

First we must understnand the conjugate direction and the terms associated with them
\begin{enumerate}
\item Krylov Subspace
\label{sec:orgd6bbe00}
Let \(A \in R^{n \times n}, b \in R^n\), the Krylov subspace \(K_j(A,b)\) is defined as \(K_j(A,b) = span \{\vec{b}, \vec{Ab}, A^2b, A^3b, \dots , A^{j-1}b\}\). Thus \(K_j(A,b)\) is subspace of \(\mathbb{R}^n\)
\item Krylov Matrix
\label{sec:orge51f90c}
The Krylov Matrix is just the matrix consisting of the basis vectors as the column vectors. The Krylov subspace is the column space of such a matrix.
\item Motivation For Krylov Subspaces
\label{sec:org14e247c}
We know the Cayley Hamilton theorem, and its use in calculating the inverse from the characteristic equation
Interestingly, the calculation for the inverse leads to a linear combination of the basis vectors of the Krylov subspace when solving linear systems.
\item Conjugate Directions
\label{sec:org61b2862}
For A real symmetric matrix \(n \times n\) with rank \(n\)

The directions \(d_0 d_1 \dots d_{n-1}\) are said to be A-conjugate if,

$$d_i Ad_j = 0 $$ for \(i \neq j\)

It's a new definition for orthogonality(not orthonormal)
\item Numerical Method
\label{sec:org836e6b8}
Input \(A,b,x^{0}\)

Compute \(\vec{r_{0}} = b - A x^0\)
\begin{verbatim}
A = [1 2 3;2 3 4;3 4 5];

b = [6 9 12]';
x = randi([-9,9], length(b),1);
r = b - A*x;
d = r;
alpha = (r'*r)/(d'*(A*d));
beta = 0;

for i = 1:size(A,1)
  x = x + alpha*d;
  rnew = r - alpha*(A*d);
  beta = (rnew'*rnew)/(r'*r);
  d = rnew + beta*d;
  r = rnew;
  alpha = (r'*r)/(d'*(A*d));
  if sqrt(rnew) < 1e-10
    break;
    end
end

x
r
\end{verbatim}
\end{enumerate}
\chapter{Probability}
\label{sec:org5c89030}
\section{Probability mass function}
\label{sec:org3739688}
For discrete inputs
The probabilty mass function for a discrete random variable \(x\) is defined as, \(f(x) = P(X = x)\)
\begin{enumerate}
\item Properties
\label{sec:org6df9378}
\begin{itemize}
\item \(0 \leq f(x) \leq 1\)
\item \(\Sigma f(x) = 1\)
