College Notes/23MAT204.org
**** Properties
- $0 \leq f(x) \leq 1$
- $\Sigma f(x) = 1$
- $p(\text{at least n outcomes}) = p(x \geq n) = f(n) + \cdots + f(end)$

**** Mean Of Random Variable
$$U_x = E(x) = \Sigma x f(x)$$

**** Variance Of Random Variable
$$\sigma_x^{2} = E((x-\mu_{x}^2)) = \Sigma (x-\mu)^2 f(x) = \Sigma x^2f(x) - \mu^{2}$$
$$\sigma_x^{2} = E(X^2) - \mu^2$$
*** Cumulative Distribution Function
A cumulative distribution function is just adding the previous terms to the new terms.
*** Probability density function - For continuous inputs
For continuous inputs

The probability density function for a continuous random variable $x$ is defined as, $P(a \le x \le b) = \int_a^b f(x)dx$

**** Binomial Distribution
The Bernoulli Process

1. Repeated trails,
2. Each trial results in an outcome that may be classified as a success
3. The trials are independent.

Where n is the number of trials, x is the random variable distribution, $q = 1 - p$
$^nC_xp^{x} q^{n-x}$

We have,
\begin{align*}
^nC_x \text{Different ways $x$ successes can occur among $n$ trials} \\
p^x - \text{probability of getting $x$ successes} \\
(1-p)^{n-x} - \text{probability of getting $n-x$ failures}
\end{align*}
**** Cumulative Distribution Function
$$\int_0^x f(y)dy$$
**** Mean Of Random Variable
$$U_x = E(x) = \Sigma x f(x)$$
**** Properties
- $f(x) \ge 0$
- $\int_xf(x) = 1$, where $\int_x$ is the range for which $x$ is defined.
- For a continuous random variable, the probability at a point is $0$, the probability that $x$ takes a discrete value is zero.
**** Uniform Distribution
A probability distribution which is constant throught the interval, given by the function,

$$f(x) = \frac{1}{b-a}  $$

$$Mean = \frac{a+b}{2}$$
$$Variance = \frac{(b-a)^2}{12}$$

$$F(x) = \int_{-\infty}^xf(x)dx = \int_{-\infty}^x \frac{1}{b-a}  $$

$$
f(X) =    \begin{cases}
0, - \infty < x < 0 \\
x, 0<x<1 \\
1, x > 1 \\
     \end{cases}
$$
**** Variance Of Random Variable
$$\sigma_x^{2} = E((x-\mu_{x}^2)) = \Sigma (x-\mu)^2 f(x) = \Sigma x^2f(x) - \mu^{2}$$

$$\sigma_x^{2} = E(X^2) - \mu^2$$
*** Joint Probability Distribution
This is given for two variables, a function $f(x,y)$ gives us a probability, $P(X= x_1, X = x_2$
**** Properties
- $0 \le f(x_1,y_1) \le 1$
- $\Sigma_x \Sigma_y f(x,y) = 1$
**** Marginal Distribution Function
Marginal distribution functions are the probability distributions of the variables themselves.

- The distribution of $x_1$ is given by the columns, and $x_2$ is given by the rows. In other words you're fixing the values and adding the remaining.
**** Mean Of Marginal Values

$Mean(X_1) = E(X_1) = \Sigma_{x1} x_1 f_{1)(x_{1})$
*** Double Integrals
$\int_x \int_y f(x,y) dy dx$
**** Area Of A Region
$$R= \int_R 1 dx dy$$
*** Joint Probability Density Function
For a continuous scalar field, $P(a \le x  \le b, c \le y \le d)$
**** Properties
- $\int\int f(x,y) dx dy = 1$
*** Independent Probabilities

Two events $A$ and $B$ are said to be independent if $P(A|B) = P(A)$ or $P(B|A) = P(B)$

Two discrete random variables $x_1$ and $x_2$ are said to be independent if $f(x_1,x_2)$ = $f(x_1)f_2(x_2) \forall x_1 \& x_2$
*** Binomial Distribution
The Bernoulli process has these properties:
1. The experiment consists of repeated trials
2. Each trial results in an outcome that may be classified as a success or failure.
*** Poisson Distribution
$$\lim_{n \rightarrow \infty} P(X=x) = \frac{e^{-\lambda}\lambda^x}{x!}$$
*** Continuous Uniform Distribution
$$f(x) = \frac{1}{b-a}$$
*** Exponential Distribution
Let N be a random variable with a Poisson Distribution with mean $\lambda x$ and X be the random variable that gives the time between each arrival or count. Then,


$$P(X > x) = P(N=0) = \frac{e^{-\lambda x}(\lambda x)^0}{0!} = e^{-\lambda x}$$
PDF,
$$\lambda e^{-\lambda x}$$
*** Gaussian/Normal Distribution
- It is one of the most common probability distribution

  $$f(x) = \frac{1}{\sqrt{2 \pi} \sigma} e^{\frac{-(x-\mu)^2}{2 \sigma^2}}$$
*** Covariance And Correlation Coefficient

Correlation is a measure of how much two data points depend on each other.

$$\rho = \frac{Cov(X_1,X_2)}{\sigma_1 \sigma_2}$$
