College Notes/exports/23MAT204.tex
\item \(p(\text{at least n outcomes}) = p(x \geq n) = f(n) + \cdots + f(end)\)
\end{itemize}
\item Mean Of Random Variable
\label{sec:org2e3b41c}
$$U_x = E(x) = \Sigma x f(x)$$
\item Variance Of Random Variable
\label{sec:org73f7749}
$$\sigma_x^{2} = E((x-\mu_{x}^2)) = \Sigma (x-\mu)^2 f(x) = \Sigma x^2f(x) - \mu^{2}$$
$$\sigma_x^{2} = E(X^2) - \mu^2$$
\end{enumerate}
\section{Cumulative Distribution Function}
\label{sec:org989a0d6}
A cumulative distribution function is just adding the previous terms to the new terms.
\section{Probability density function - For continuous inputs}
\label{sec:org8adaf97}
For continuous inputs

The probability density function for a continuous random variable \(x\) is defined as, \(P(a \le x \le b) = \int_a^b f(x)dx\)
\begin{enumerate}
\item Binomial Distribution
\label{sec:orgf164233}
The Bernoulli Process

\begin{enumerate}
\item Repeated trails,
\item Each trial results in an outcome that may be classified as a success
\item The trials are independent.
\end{enumerate}

Where n is the number of trials, x is the random variable distribution, \(q = 1 - p\)
\(^nC_xp^{x} q^{n-x}\)

We have,
\begin{align*}
^nC_x \text{Different ways $x$ successes can occur among $n$ trials} \\
p^x - \text{probability of getting $x$ successes} \\
(1-p)^{n-x} - \text{probability of getting $n-x$ failures}
\end{align*}
\item Cumulative Distribution Function
\label{sec:org503b5a7}
$$\int_0^x f(y)dy$$
\item Mean Of Random Variable
\label{sec:orgadca4b8}
$$U_x = E(x) = \Sigma x f(x)$$
\item Properties
\label{sec:orge233fa8}
\begin{itemize}
\item \(f(x) \ge 0\)
\item \(\int_xf(x) = 1\), where \(\int_x\) is the range for which \(x\) is defined.
\item For a continuous random variable, the probability at a point is \(0\), the probability that \(x\) takes a discrete value is zero.
\end{itemize}
\item Uniform Distribution
\label{sec:org713e3ff}
A probability distribution which is constant throught the interval, given by the function,

$$f(x) = \frac{1}{b-a}  $$

$$Mean = \frac{a+b}{2}$$
$$Variance = \frac{(b-a)^2}{12}$$

$$F(x) = \int_{-\infty}^xf(x)dx = \int_{-\infty}^x \frac{1}{b-a}  $$

$$
f(X) =    \begin{cases}
0, - \infty < x < 0 \\
x, 0<x<1 \\
1, x > 1 \\
     \end{cases}
$$
\item Variance Of Random Variable
\label{sec:orgc9e7061}
$$\sigma_x^{2} = E((x-\mu_{x}^2)) = \Sigma (x-\mu)^2 f(x) = \Sigma x^2f(x) - \mu^{2}$$

$$\sigma_x^{2} = E(X^2) - \mu^2$$
\end{enumerate}
\section{Joint Probability Distribution}
\label{sec:org8e908ff}
This is given for two variables, a function \(f(x,y)\) gives us a probability, \(P(X= x_1, X = x_2\)
\begin{enumerate}
\item Properties
\label{sec:org895e516}
\begin{itemize}
\item \(0 \le f(x_1,y_1) \le 1\)
\item \(\Sigma_x \Sigma_y f(x,y) = 1\)
\end{itemize}
\item Marginal Distribution Function
\label{sec:org5e74d85}
Marginal distribution functions are the probability distributions of the variables themselves.

\begin{itemize}
\item The distribution of \(x_1\) is given by the columns, and \(x_2\) is given by the rows. In other words you're fixing the values and adding the remaining.
\end{itemize}
\item Mean Of Marginal Values
\label{sec:org04d741a}

\(Mean(X_1) = E(X_1) = \Sigma_{x1} x_1 f_{1)(x_{1})\)
\end{enumerate}
\section{Double Integrals}
\label{sec:org3dd0dcf}
\(\int_x \int_y f(x,y) dy dx\)
\begin{enumerate}
\item Area Of A Region
\label{sec:orgbd6d871}
$$R= \int_R 1 dx dy$$
\end{enumerate}
\section{Joint Probability Density Function}
\label{sec:orgf75d860}
For a continuous scalar field, \(P(a \le x  \le b, c \le y \le d)\)
\begin{enumerate}
\item Properties
\label{sec:org2d1b20a}
\begin{itemize}
\item \(\int\int f(x,y) dx dy = 1\)
\end{itemize}
\end{enumerate}
\section{Independent Probabilities}
\label{sec:org665993c}

Two events \(A\) and \(B\) are said to be independent if \(P(A|B) = P(A)\) or \(P(B|A) = P(B)\)

Two discrete random variables \(x_1\) and \(x_2\) are said to be independent if \(f(x_1,x_2)\) = \(f(x_1)f_2(x_2) \forall x_1 \& x_2\)
\section{Binomial Distribution}
\label{sec:org87842cd}
The Bernoulli process has these properties:
\begin{enumerate}
\item The experiment consists of repeated trials
\item Each trial results in an outcome that may be classified as a success or failure.
\end{enumerate}
\section{Poisson Distribution}
\label{sec:org7338e77}
$$\lim_{n \rightarrow \infty} P(X=x) = \frac{e^{-\lambda}\lambda^x}{x!}$$
\section{Continuous Uniform Distribution}
\label{sec:org2f0312b}
$$f(x) = \frac{1}{b-a}$$
\section{Exponential Distribution}
\label{sec:orgfc85264}
Let N be a random variable with a Poisson Distribution with mean \(\lambda x\) and X be the random variable that gives the time between each arrival or count. Then,


$$P(X > x) = P(N=0) = \frac{e^{-\lambda x}(\lambda x)^0}{0!} = e^{-\lambda x}$$

PDF,
$$\lambda e^{-\lambda x}$$
\section{Gaussian Normal Distribution}
\label{sec:org3cd3035}
\end{document}
